Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 32, 32, 16)   432         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 32, 32, 16)   64          conv2d[0][0]                     
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 32, 32, 16)   0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 160)  23040       re_lu[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 32, 32, 160)  640         conv2d_1[0][0]                   
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 32, 32, 160)  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32, 32, 160)  0           re_lu_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 160)  230400      dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 160)  2560        re_lu[0][0]                      
__________________________________________________________________________________________________
add (Add)                       (None, 32, 32, 160)  0           conv2d_2[0][0]                   
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 160)  640         add[0][0]                        
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 32, 32, 160)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 160)  230400      re_lu_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 160)  640         conv2d_4[0][0]                   
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 32, 32, 160)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 32, 160)  0           re_lu_3[0][0]                    
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 160)  230400      dropout_1[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 160)  0           conv2d_5[0][0]                   
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 160)  640         add_1[0][0]                      
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 32, 32, 160)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 160)  230400      re_lu_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 160)  640         conv2d_6[0][0]                   
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 32, 32, 160)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 32, 32, 160)  0           re_lu_5[0][0]                    
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 160)  230400      dropout_2[0][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 160)  0           conv2d_7[0][0]                   
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 160)  640         add_2[0][0]                      
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 32, 32, 160)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 160)  230400      re_lu_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 160)  640         conv2d_8[0][0]                   
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 32, 32, 160)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 32, 32, 160)  0           re_lu_7[0][0]                    
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 160)  230400      dropout_3[0][0]                  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 160)  0           conv2d_9[0][0]                   
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 32, 160)  640         add_3[0][0]                      
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 32, 32, 160)  0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 320)  460800      re_lu_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 320)  1280        conv2d_10[0][0]                  
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 16, 16, 320)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 16, 16, 320)  0           re_lu_9[0][0]                    
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 320)  921600      dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 320)  51200       re_lu_8[0][0]                    
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 320)  0           conv2d_11[0][0]                  
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 320)  1280        add_4[0][0]                      
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 16, 16, 320)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 320)  921600      re_lu_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 320)  1280        conv2d_13[0][0]                  
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 16, 16, 320)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 16, 16, 320)  0           re_lu_11[0][0]                   
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 16, 320)  921600      dropout_5[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 320)  0           conv2d_14[0][0]                  
                                                                 add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 320)  1280        add_5[0][0]                      
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 16, 16, 320)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 16, 16, 320)  921600      re_lu_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 320)  1280        conv2d_15[0][0]                  
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 16, 16, 320)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 16, 16, 320)  0           re_lu_13[0][0]                   
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 16, 16, 320)  921600      dropout_6[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 16, 320)  0           conv2d_16[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 16, 16, 320)  1280        add_6[0][0]                      
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 16, 16, 320)  0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 16, 16, 320)  921600      re_lu_14[0][0]                   
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 16, 16, 320)  1280        conv2d_17[0][0]                  
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 16, 16, 320)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 16, 16, 320)  0           re_lu_15[0][0]                   
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 16, 16, 320)  921600      dropout_7[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 16, 16, 320)  0           conv2d_18[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 16, 16, 320)  1280        add_7[0][0]                      
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 16, 16, 320)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 8, 8, 640)    1843200     re_lu_16[0][0]                   
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 640)    2560        conv2d_19[0][0]                  
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 8, 8, 640)    0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 8, 8, 640)    0           re_lu_17[0][0]                   
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 8, 8, 640)    3686400     dropout_8[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 8, 8, 640)    204800      re_lu_16[0][0]                   
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 640)    0           conv2d_20[0][0]                  
                                                                 conv2d_21[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8, 8, 640)    2560        add_8[0][0]                      
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 (None, 8, 8, 640)    0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 8, 8, 640)    3686400     re_lu_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 8, 8, 640)    2560        conv2d_22[0][0]                  
__________________________________________________________________________________________________
re_lu_19 (ReLU)                 (None, 8, 8, 640)    0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 8, 8, 640)    0           re_lu_19[0][0]                   
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 8, 8, 640)    3686400     dropout_9[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 8, 8, 640)    0           conv2d_23[0][0]                  
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 8, 8, 640)    2560        add_9[0][0]                      
__________________________________________________________________________________________________
re_lu_20 (ReLU)                 (None, 8, 8, 640)    0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 8, 8, 640)    3686400     re_lu_20[0][0]                   
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 8, 8, 640)    2560        conv2d_24[0][0]                  
__________________________________________________________________________________________________
re_lu_21 (ReLU)                 (None, 8, 8, 640)    0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 8, 8, 640)    0           re_lu_21[0][0]                   
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 8, 8, 640)    3686400     dropout_10[0][0]                 
__________________________________________________________________________________________________
add_10 (Add)                    (None, 8, 8, 640)    0           conv2d_25[0][0]                  
                                                                 add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 8, 8, 640)    2560        add_10[0][0]                     
__________________________________________________________________________________________________
re_lu_22 (ReLU)                 (None, 8, 8, 640)    0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 8, 8, 640)    3686400     re_lu_22[0][0]                   
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 8, 8, 640)    2560        conv2d_26[0][0]                  
__________________________________________________________________________________________________
re_lu_23 (ReLU)                 (None, 8, 8, 640)    0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 8, 8, 640)    0           re_lu_23[0][0]                   
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 8, 8, 640)    3686400     dropout_11[0][0]                 
__________________________________________________________________________________________________
add_11 (Add)                    (None, 8, 8, 640)    0           conv2d_27[0][0]                  
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 8, 8, 640)    2560        add_11[0][0]                     
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 (None, 8, 8, 640)    0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 640)          0           re_lu_24[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           6410        global_average_pooling2d[0][0]   
==================================================================================================
Total params: 36,497,146
Trainable params: 36,479,194
Non-trainable params: 17,952
__________________________________________________________________________________________________