__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 32, 32, 16)   432         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1 (BatchNo (None, 32, 32, 16)   64          conv2d[0][0]                     
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 32, 32, 16)   0           batch_normalization_v1[0][0]     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 16)   2304        re_lu[0][0]                      
__________________________________________________________________________________________________
batch_normalization_v1_1 (Batch (None, 32, 32, 16)   64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_1[0][0]   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_2 (Batch (None, 32, 32, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_2[0][0]   
__________________________________________________________________________________________________
add (Add)                       (None, 32, 32, 16)   0           re_lu_2[0][0]                    
                                                                 re_lu[0][0]                      
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 32, 32, 16)   0           add[0][0]                        
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_3 (Batch (None, 32, 32, 16)   64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_3[0][0]   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_4 (Batch (None, 32, 32, 16)   64          conv2d_4[0][0]                   
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_4[0][0]   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           re_lu_5[0][0]                    
                                                                 re_lu_3[0][0]                    
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 32, 32, 16)   0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_5 (Batch (None, 32, 32, 16)   64          conv2d_5[0][0]                   
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_5[0][0]   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_6 (Batch (None, 32, 32, 16)   64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_6[0][0]   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 16)   0           re_lu_8[0][0]                    
                                                                 re_lu_6[0][0]                    
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 32, 32, 16)   0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_7 (Batch (None, 32, 32, 16)   64          conv2d_7[0][0]                   
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 32, 32, 16)   0           batch_normalization_v1_7[0][0]   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_8 (Batch (None, 32, 32, 16)   64          conv2d_8[0][0]                   
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 32, 32, 16)   0           batch_normalization_v1_8[0][0]   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 16)   0           re_lu_11[0][0]                   
                                                                 re_lu_9[0][0]                    
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 32, 32, 16)   0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_9 (Batch (None, 32, 32, 16)   64          conv2d_9[0][0]                   
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 32, 32, 16)   0           batch_normalization_v1_9[0][0]   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 16)   2304        re_lu_13[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_10 (Batc (None, 32, 32, 16)   64          conv2d_10[0][0]                  
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 32, 32, 16)   0           batch_normalization_v1_10[0][0]  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 32, 16)   0           re_lu_14[0][0]                   
                                                                 re_lu_12[0][0]                   
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 32, 32, 16)   0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 32, 16)   2304        re_lu_15[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_11 (Batc (None, 32, 32, 16)   64          conv2d_11[0][0]                  
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 32, 32, 16)   0           batch_normalization_v1_11[0][0]  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 32, 32, 16)   2304        re_lu_16[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_12 (Batc (None, 32, 32, 16)   64          conv2d_12[0][0]                  
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 32, 32, 16)   0           batch_normalization_v1_12[0][0]  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 32, 32, 16)   0           re_lu_17[0][0]                   
                                                                 re_lu_15[0][0]                   
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 (None, 32, 32, 16)   0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 32, 32, 16)   2304        re_lu_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_13 (Batc (None, 32, 32, 16)   64          conv2d_13[0][0]                  
__________________________________________________________________________________________________
re_lu_19 (ReLU)                 (None, 32, 32, 16)   0           batch_normalization_v1_13[0][0]  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 32, 32, 16)   2304        re_lu_19[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_14 (Batc (None, 32, 32, 16)   64          conv2d_14[0][0]                  
__________________________________________________________________________________________________
re_lu_20 (ReLU)                 (None, 32, 32, 16)   0           batch_normalization_v1_14[0][0]  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 32, 32, 16)   0           re_lu_20[0][0]                   
                                                                 re_lu_18[0][0]                   
__________________________________________________________________________________________________
re_lu_21 (ReLU)                 (None, 32, 32, 16)   0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 16, 16, 32)   4608        re_lu_21[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_15 (Batc (None, 16, 16, 32)   128         conv2d_15[0][0]                  
__________________________________________________________________________________________________
re_lu_22 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_15[0][0]  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_22[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_16 (Batc (None, 16, 16, 32)   128         conv2d_16[0][0]                  
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 16, 16, 16)   0           re_lu_21[0][0]                   
__________________________________________________________________________________________________
re_lu_23 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_16[0][0]  
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 16, 16, 32)   0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 16, 16, 32)   0           re_lu_23[0][0]                   
                                                                 lambda[0][0]                     
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 (None, 16, 16, 32)   0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_24[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_17 (Batc (None, 16, 16, 32)   128         conv2d_17[0][0]                  
__________________________________________________________________________________________________
re_lu_25 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_17[0][0]  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_25[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_18 (Batc (None, 16, 16, 32)   128         conv2d_18[0][0]                  
__________________________________________________________________________________________________
re_lu_26 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_18[0][0]  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 16, 16, 32)   0           re_lu_26[0][0]                   
                                                                 re_lu_24[0][0]                   
__________________________________________________________________________________________________
re_lu_27 (ReLU)                 (None, 16, 16, 32)   0           add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_27[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_19 (Batc (None, 16, 16, 32)   128         conv2d_19[0][0]                  
__________________________________________________________________________________________________
re_lu_28 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_19[0][0]  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_28[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_20 (Batc (None, 16, 16, 32)   128         conv2d_20[0][0]                  
__________________________________________________________________________________________________
re_lu_29 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_20[0][0]  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 16, 16, 32)   0           re_lu_29[0][0]                   
                                                                 re_lu_27[0][0]                   
__________________________________________________________________________________________________
re_lu_30 (ReLU)                 (None, 16, 16, 32)   0           add_9[0][0]                      
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_30[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_21 (Batc (None, 16, 16, 32)   128         conv2d_21[0][0]                  
__________________________________________________________________________________________________
re_lu_31 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_21[0][0]  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_31[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_22 (Batc (None, 16, 16, 32)   128         conv2d_22[0][0]                  
__________________________________________________________________________________________________
re_lu_32 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_22[0][0]  
__________________________________________________________________________________________________
add_10 (Add)                    (None, 16, 16, 32)   0           re_lu_32[0][0]                   
                                                                 re_lu_30[0][0]                   
__________________________________________________________________________________________________
re_lu_33 (ReLU)                 (None, 16, 16, 32)   0           add_10[0][0]                     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_33[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_23 (Batc (None, 16, 16, 32)   128         conv2d_23[0][0]                  
__________________________________________________________________________________________________
re_lu_34 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_23[0][0]  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_34[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_24 (Batc (None, 16, 16, 32)   128         conv2d_24[0][0]                  
__________________________________________________________________________________________________
re_lu_35 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_24[0][0]  
__________________________________________________________________________________________________
add_11 (Add)                    (None, 16, 16, 32)   0           re_lu_35[0][0]                   
                                                                 re_lu_33[0][0]                   
__________________________________________________________________________________________________
re_lu_36 (ReLU)                 (None, 16, 16, 32)   0           add_11[0][0]                     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_36[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_25 (Batc (None, 16, 16, 32)   128         conv2d_25[0][0]                  
__________________________________________________________________________________________________
re_lu_37 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_25[0][0]  
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_37[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_26 (Batc (None, 16, 16, 32)   128         conv2d_26[0][0]                  
__________________________________________________________________________________________________
re_lu_38 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_26[0][0]  
__________________________________________________________________________________________________
add_12 (Add)                    (None, 16, 16, 32)   0           re_lu_38[0][0]                   
                                                                 re_lu_36[0][0]                   
__________________________________________________________________________________________________
re_lu_39 (ReLU)                 (None, 16, 16, 32)   0           add_12[0][0]                     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_39[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_27 (Batc (None, 16, 16, 32)   128         conv2d_27[0][0]                  
__________________________________________________________________________________________________
re_lu_40 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_27[0][0]  
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_40[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_28 (Batc (None, 16, 16, 32)   128         conv2d_28[0][0]                  
__________________________________________________________________________________________________
re_lu_41 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_28[0][0]  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 16, 16, 32)   0           re_lu_41[0][0]                   
                                                                 re_lu_39[0][0]                   
__________________________________________________________________________________________________
re_lu_42 (ReLU)                 (None, 16, 16, 32)   0           add_13[0][0]                     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 8, 8, 64)     18432       re_lu_42[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_29 (Batc (None, 8, 8, 64)     256         conv2d_29[0][0]                  
__________________________________________________________________________________________________
re_lu_43 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_29[0][0]  
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_43[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_30 (Batc (None, 8, 8, 64)     256         conv2d_30[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 8, 8, 32)     0           re_lu_42[0][0]                   
__________________________________________________________________________________________________
re_lu_44 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_30[0][0]  
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 8, 8, 64)     0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
add_14 (Add)                    (None, 8, 8, 64)     0           re_lu_44[0][0]                   
                                                                 lambda_1[0][0]                   
__________________________________________________________________________________________________
re_lu_45 (ReLU)                 (None, 8, 8, 64)     0           add_14[0][0]                     
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_45[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_31 (Batc (None, 8, 8, 64)     256         conv2d_31[0][0]                  
__________________________________________________________________________________________________
re_lu_46 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_31[0][0]  
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_46[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_32 (Batc (None, 8, 8, 64)     256         conv2d_32[0][0]                  
__________________________________________________________________________________________________
re_lu_47 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_32[0][0]  
__________________________________________________________________________________________________
add_15 (Add)                    (None, 8, 8, 64)     0           re_lu_47[0][0]                   
                                                                 re_lu_45[0][0]                   
__________________________________________________________________________________________________
re_lu_48 (ReLU)                 (None, 8, 8, 64)     0           add_15[0][0]                     
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_48[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_33 (Batc (None, 8, 8, 64)     256         conv2d_33[0][0]                  
__________________________________________________________________________________________________
re_lu_49 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_33[0][0]  
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_49[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_34 (Batc (None, 8, 8, 64)     256         conv2d_34[0][0]                  
__________________________________________________________________________________________________
re_lu_50 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_34[0][0]  
__________________________________________________________________________________________________
add_16 (Add)                    (None, 8, 8, 64)     0           re_lu_50[0][0]                   
                                                                 re_lu_48[0][0]                   
__________________________________________________________________________________________________
re_lu_51 (ReLU)                 (None, 8, 8, 64)     0           add_16[0][0]                     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_51[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_35 (Batc (None, 8, 8, 64)     256         conv2d_35[0][0]                  
__________________________________________________________________________________________________
re_lu_52 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_35[0][0]  
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_52[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_36 (Batc (None, 8, 8, 64)     256         conv2d_36[0][0]                  
__________________________________________________________________________________________________
re_lu_53 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_36[0][0]  
__________________________________________________________________________________________________
add_17 (Add)                    (None, 8, 8, 64)     0           re_lu_53[0][0]                   
                                                                 re_lu_51[0][0]                   
__________________________________________________________________________________________________
re_lu_54 (ReLU)                 (None, 8, 8, 64)     0           add_17[0][0]                     
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_54[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_37 (Batc (None, 8, 8, 64)     256         conv2d_37[0][0]                  
__________________________________________________________________________________________________
re_lu_55 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_37[0][0]  
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_55[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_38 (Batc (None, 8, 8, 64)     256         conv2d_38[0][0]                  
__________________________________________________________________________________________________
re_lu_56 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_38[0][0]  
__________________________________________________________________________________________________
add_18 (Add)                    (None, 8, 8, 64)     0           re_lu_56[0][0]                   
                                                                 re_lu_54[0][0]                   
__________________________________________________________________________________________________
re_lu_57 (ReLU)                 (None, 8, 8, 64)     0           add_18[0][0]                     
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_57[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_39 (Batc (None, 8, 8, 64)     256         conv2d_39[0][0]                  
__________________________________________________________________________________________________
re_lu_58 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_39[0][0]  
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_58[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_40 (Batc (None, 8, 8, 64)     256         conv2d_40[0][0]                  
__________________________________________________________________________________________________
re_lu_59 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_40[0][0]  
__________________________________________________________________________________________________
add_19 (Add)                    (None, 8, 8, 64)     0           re_lu_59[0][0]                   
                                                                 re_lu_57[0][0]                   
__________________________________________________________________________________________________
re_lu_60 (ReLU)                 (None, 8, 8, 64)     0           add_19[0][0]                     
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_60[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_41 (Batc (None, 8, 8, 64)     256         conv2d_41[0][0]                  
__________________________________________________________________________________________________
re_lu_61 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_41[0][0]  
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_61[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_42 (Batc (None, 8, 8, 64)     256         conv2d_42[0][0]                  
__________________________________________________________________________________________________
re_lu_62 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_42[0][0]  
__________________________________________________________________________________________________
add_20 (Add)                    (None, 8, 8, 64)     0           re_lu_62[0][0]                   
                                                                 re_lu_60[0][0]                   
__________________________________________________________________________________________________
re_lu_63 (ReLU)                 (None, 8, 8, 64)     0           add_20[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 64)           0           re_lu_63[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           650         global_average_pooling2d[0][0]   
==================================================================================================
Total params: 661,754
Trainable params: 658,586
Non-trainable params: 3,168
__________________________________________________________________________________________________