__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 32, 32, 16)   432         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1 (BatchNo (None, 32, 32, 16)   64          conv2d[0][0]                     
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 32, 32, 16)   0           batch_normalization_v1[0][0]     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 16)   2304        re_lu[0][0]                      
__________________________________________________________________________________________________
batch_normalization_v1_1 (Batch (None, 32, 32, 16)   64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_1[0][0]   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_2 (Batch (None, 32, 32, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_2[0][0]   
__________________________________________________________________________________________________
add (Add)                       (None, 32, 32, 16)   0           re_lu_2[0][0]                    
                                                                 re_lu[0][0]                      
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 32, 32, 16)   0           add[0][0]                        
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_3 (Batch (None, 32, 32, 16)   64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_3[0][0]   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_4 (Batch (None, 32, 32, 16)   64          conv2d_4[0][0]                   
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_4[0][0]   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           re_lu_5[0][0]                    
                                                                 re_lu_3[0][0]                    
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 32, 32, 16)   0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_5 (Batch (None, 32, 32, 16)   64          conv2d_5[0][0]                   
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_5[0][0]   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 16)   2304        re_lu_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_6 (Batch (None, 32, 32, 16)   64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 32, 32, 16)   0           batch_normalization_v1_6[0][0]   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 16)   0           re_lu_8[0][0]                    
                                                                 re_lu_6[0][0]                    
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 32, 32, 16)   0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 16, 16, 32)   4608        re_lu_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_7 (Batch (None, 16, 16, 32)   128         conv2d_7[0][0]                   
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_7[0][0]   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 32)   9216        re_lu_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_8 (Batch (None, 16, 16, 32)   128         conv2d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 16, 16, 16)   0           re_lu_9[0][0]                    
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_8[0][0]   
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 16, 16, 32)   0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
add_3 (Add)                     (None, 16, 16, 32)   0           re_lu_11[0][0]                   
                                                                 lambda[0][0]                     
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 16, 16, 32)   0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 16, 16, 32)   9216        re_lu_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_9 (Batch (None, 16, 16, 32)   128         conv2d_9[0][0]                   
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_9[0][0]   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_13[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_10 (Batc (None, 16, 16, 32)   128         conv2d_10[0][0]                  
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_10[0][0]  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 32)   0           re_lu_14[0][0]                   
                                                                 re_lu_12[0][0]                   
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 16, 16, 32)   0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_15[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_11 (Batc (None, 16, 16, 32)   128         conv2d_11[0][0]                  
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_11[0][0]  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 32)   9216        re_lu_16[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_12 (Batc (None, 16, 16, 32)   128         conv2d_12[0][0]                  
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 16, 16, 32)   0           batch_normalization_v1_12[0][0]  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 32)   0           re_lu_17[0][0]                   
                                                                 re_lu_15[0][0]                   
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 (None, 16, 16, 32)   0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 8, 8, 64)     18432       re_lu_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_13 (Batc (None, 8, 8, 64)     256         conv2d_13[0][0]                  
__________________________________________________________________________________________________
re_lu_19 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_13[0][0]  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_19[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_14 (Batc (None, 8, 8, 64)     256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 8, 8, 32)     0           re_lu_18[0][0]                   
__________________________________________________________________________________________________
re_lu_20 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_14[0][0]  
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 8, 8, 64)     0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
add_6 (Add)                     (None, 8, 8, 64)     0           re_lu_20[0][0]                   
                                                                 lambda_1[0][0]                   
__________________________________________________________________________________________________
re_lu_21 (ReLU)                 (None, 8, 8, 64)     0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_21[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_15 (Batc (None, 8, 8, 64)     256         conv2d_15[0][0]                  
__________________________________________________________________________________________________
re_lu_22 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_15[0][0]  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_22[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_16 (Batc (None, 8, 8, 64)     256         conv2d_16[0][0]                  
__________________________________________________________________________________________________
re_lu_23 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_16[0][0]  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 8, 64)     0           re_lu_23[0][0]                   
                                                                 re_lu_21[0][0]                   
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 (None, 8, 8, 64)     0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_24[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_17 (Batc (None, 8, 8, 64)     256         conv2d_17[0][0]                  
__________________________________________________________________________________________________
re_lu_25 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_17[0][0]  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 8, 8, 64)     36864       re_lu_25[0][0]                   
__________________________________________________________________________________________________
batch_normalization_v1_18 (Batc (None, 8, 8, 64)     256         conv2d_18[0][0]                  
__________________________________________________________________________________________________
re_lu_26 (ReLU)                 (None, 8, 8, 64)     0           batch_normalization_v1_18[0][0]  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 64)     0           re_lu_26[0][0]                   
                                                                 re_lu_24[0][0]                   
__________________________________________________________________________________________________
re_lu_27 (ReLU)                 (None, 8, 8, 64)     0           add_8[0][0]                      
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 64)           0           re_lu_27[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           650         global_average_pooling2d[0][0]   
==================================================================================================
Total params: 271,098
Trainable params: 269,722
Non-trainable params: 1,376
__________________________________________________________________________________________________